---
kind: method
id: M:Autodesk.Revit.DB.Form.IsCurveReference(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/d94d65e3-9a76-fad0-cc3a-95526f42be63.htm
---
# Autodesk.Revit.DB.Form.IsCurveReference Method

**中文**: 对话框、窗口、窗体

Tell if the pick is the reference to a curve of the form.

## Syntax (C#)
```csharp
public bool IsCurveReference(
	Reference curveReference
)
```

## Parameters
- **curveReference** (`Autodesk.Revit.DB.Reference`) - Reference to be checked.